DUDOooo/STM32F103C8T6/9-3 串口收发HEX数据包/main.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"  
#include "OLED.h"  
#include "Serial.h"  
#include "Key.h" 

uint8_t RxData;//收到的数据
uint8_t KeyNum;//

int main(void)
{
	OLED_Init();
	Serial_Init();
	KEY_Init();

	OLED_ShowString(1,1,"RxData:");
	OLED_ShowString(3,1,"TxData:");
	
	Serial_TxPacket[0]=0X01;
	Serial_TxPacket[1]=0X02;
	Serial_TxPacket[2]=0X03;
	Serial_TxPacket[3]=0X04;
	
	while(1)
	{
		KeyNum=Key_GetNum();
		
		if(KeyNum==1)
		{
			Serial_TxPacket[0]++;
			Serial_TxPacket[1]++;
			Serial_TxPacket[2]++;
			Serial_TxPacket[3]++;
			
			Serial_SendPacket();
			
			OLED_ShowHexNum(2,1,Serial_TxPacket[0],2);
			OLED_ShowHexNum(2,4,Serial_TxPacket[1],2);
			OLED_ShowHexNum(2,7,Serial_TxPacket[2],2);
			OLED_ShowHexNum(2,10,Serial_TxPacket[3],2);
		}
			if(Serial_GetRxFlag()==1)//接收中断用法
			{
				OLED_ShowHexNum(4,1,Serial_RxPacket[0],2);
				OLED_ShowHexNum(4,4,Serial_RxPacket[1],2);
				OLED_ShowHexNum(4,7,Serial_RxPacket[2],2);
				OLED_ShowHexNum(4,10,Serial_RxPacket[3],2);
			}
	}
}

